text_1 = '''текст 1 (введи код приглашения, изменить его будет не возможно)'''
text_2 = '''текст 2 (такого кода не существует, ещё раз)'''
text_3 = '''текст 3 (код сохранён, теперь вы можите ознакомиться с правилами и тд (тут должна быть ссылка на правила, например на новый канал с правилами))'''
text_4 = '''текст 4 (подтверлите своё согласие с правилами)'''
text_5 = '''текст 5 (теперь ты можешь начать зарабатывать, вот пару ссылок на наши группы и тд)'''
text_6 = '''текст 6 (вы в главном меню, где есть все разделы)'''
text_7 = '''текст 7 (вы можите ещё раз ознакомиться с правилами и тд)'''
text_8 = '''текст 8 (самый сложный текст, надо очень подробно, понятно и убедительно расписать инструкцию)'''
text_9 = '''текст 9 (вы в разделе отзывов)'''
text_10 = '''текст 10 (посмотреть другие отзывы можно тут)'''
text_11 = '''текст 11 (публиковать отзыв можно раз в 6 часов, чтоб не было спама, а вы его недавно публиковалм)'''
text_12 = '''текст 12 (следующее введённое вами сообщение будет публиковано в канале с отзывами)'''
text_13 = '''текст 13 (ваш отзыв опубликован, спасибо за ваше мнение. Вы в разделе отзывов)'''
text_14 = '''текст 14 (Этот баланс нельзя вывести, он нужен только для внутрених покупок. Ваш баланс следующий)'''
text_15 = '''текст 15 (вы можите пополнить свой баланс через qiwi по ссылке https://qiwi.com/n/OTEAV080, введя в коментарий ваш однаразовый код )'''
text_16 = '''текст 16 (выбирете дальнейшие действия)'''
text_17 = '''текст 17 (вышего перевода не обнаружено, попробуйте ещё раз, а если не помогло, то обратитесь в поддержку)'''
text_18 = '''текст 18 (мы увидели новый перевод, и уже пополнели вам баланс, теперь на вашем кошельке )'''
text_19 = '''текст 19 (и вы в главном меню)'''
text_20 = '''текст 20 (Это статистика за всё время, вы заработали от приглашений )'''
text_21 = '''текст 21 (выбирете, как вы бы хотели получать прибыль)'''
text_22 = '''текст 22 (введите ваш номер телефона, к которому привязан кошелёк в формате 89008007060, если будет не верный, то вы просто не сможем вам отправлять процент)'''
text_24 = '''текст 24 (вы ввели не правильно номер телефона, введите ещё раз, но в формате 89008007060 (11 цифр))'''
text_25 = '''текст 25 (внесённые данные сохранены, вы можите изменить их в разделе настроек)'''
text_26 = '''текст 26 (у вас нет ни одного специального кода, вы можите создать его)'''
text_27 = '''текст 27 (выбирете, какой спец. код вы хотите создать:\n*мини (бесплатный и комиссия 60%)\n\n*полный (100 руб и комиссия 20%))'''
text_28 = '''текст 28 (у вас уже есть максимальный спец. код)'''
text_29 = '''текст 29 (теперь вы можите приглашать своих друзей и других людей, говорю им свой новый спец. код (тут инструкция))'''
text_30 = '''текст 30 (у вас есть максимальный спец. код :)'''
text_31 = '''текст 31 (на вашем балансе должно быть как минимум 100 рублей, но это не так, вы можите пополнить его в разделе "мой баланс")'''
text_32 = '''текст 32 (Поздравляем с покупкой, теперь вы можите приглашать своих друзей и тд)'''
text_33 = '''текст 33 (Вы ранее уже создали бесплатный, уменьшенный спец. код)'''
text_34 = '''текст 34 (Но можно оформить улучшеный спец.код всего за 100 руб. (акция в первый месяц))'''
text_35 = '''текст 35 (У вас нет доступа к этой комманде!)'''
text_36 = '''текст 36 (введите ваш номер карты, на которую мы будем вам оправлять ваш доход, если будет не верный, то мы просто не сможем вам отправлять деньги)'''
text_37 = '''текст 37 (Так как вы выбрали тип вывода средств через карту, то мы не можем автоматически присылать вам деньги, придётся ждать, когда вы заработаете более 100 рублей и мы оформим вашу прибыль, это не быстрый процесс)'''
text_38 = '''текст 38 (вы можите пополнить свой баланс через Сбербанк на карту **************2345, введя в коментарий ваш однаразовый код )'''
text_39 = '''текст 39 (И затем просто ждать, кода ваш перевод одобрят наши сотрудники, это может занятьт некоторое время, но перевод через qiwi происходит моментально)'''
text_40 = '''текст 40 (Текст в разделе /help (что-нибудь придумаешь, например, вот ссылки, чтоб выбраться от сёда нипишите любое сообщение))'''
text_41 = '''текст 41 (Ваше пополнение баланса обработали, вы можите проверить в разделе "мой баланс")'''
text_42 = '''текст 42 (Вы заработали достаточно, чтоб вывести средства, и наш сотрудник вывел вам на карту деньги, проверьте)'''
text_43 = '''текст 43 (Здраствуйте, у вас не коректно внесены данные для перевода и наш сотркдник не может сделать перевод, обнавите в настройках свои данные)'''
text_44 = '''текст 44 (Сдесь вы можите изменить некоторые свои данные о выводе и написать нам в поддержку)'''
text_45 = '''текст 45 (Следующее введённое сообщение будет видно для администрации, которая вам может быть ответит, спамить пожалуйста не надо)'''
text_46 = '''текст 46 (Ваше сообщение отправлено, ждите ответа)'''
text_47 = '''текст 47 (тут немного текста о том, какие у нас есть каналы и чаты)'''



button_back = 'кнопка back (вернуться назад)'
button_1 = 'кнопка 1 (у меня нету)'
button_2 = 'кнопка 2 (я ознакомился с правилами и принимаю их)'

button_3 = 'кнопка 3 (напомнить правила)'   # +
button_4 = 'кнопка 4 (мой баланс)'          # +
button_5 = 'кнопка 5 (статистика)'          # +
button_6 = 'кнопка 6 (публиковать отзыв)'   # +
button_7 = 'кнопка 7 (мой кодик и тд)'      # +
button_8 = 'кнопка 8 (инструкция)'          # +
button_13 = 'кнопка 13 (настройки)'

button_9 = 'кнопка 9 (публиковать новый отзыв)'

button_10 = 'кнопка 10 (проверить пополнение баланса)'
button_11 = 'кнопка 11 (пополнить через qiwi)'
button_12 = 'кнопка 12 (пополнить через Сбербанк)'

button_14 = 'кнопка 14 (на счёт qiwi)'
button_15 = 'кнопка 15 (на карту Сбербанк)'

button_16 = 'кнопка 16 (создать)'
button_17 = 'кнопка 17 (мини (бесплатный и комиссия 60%))'
button_18 = 'кнопка 18 (полный (100 руб и комиссия 20%))'

button_19 = 'кнопка 19 (создать запрос на вывод баланса)'

button_20 = 'кнопка 20 (изменить способ вывода средств и номер)'
button_21 = 'кнопка 21 (написать в поддержку)'   # +
button_22 = 'кнопка 22 (все наши каналы и чаты)'   # +



buttons_main_menu = [[button_8, button_3], [button_4, button_7], [button_6, button_5, button_13]]
buttons_comment_menu_1 = [[button_9], [button_back]]
buttons_setings_menu = [[button_20, button_21, button_22], [button_back]]