text_1 = '''введи код приглашения, изменить его будет не возможно'''
text_2 = '''такого кода не существует, попробуйте ещё раз'''
text_3 = '''код сохранён, теперь вы можете ознакомиться с правилами сообщества @Real_mony_pravila'''
text_4 = '''подтвердите своё согласие с правилами'''
text_5 = '''теперь ты можешь начать зарабатывать, вот пару ссылок на наши группы'''
text_6 = '''Вы в главном меню'''
text_7 = '''вы можете ещё раз ознакомиться с правилами сообщества @Real_mony_pravila'''
text_8 = '''Наверняка ты тот кто это читает хочешь узнать как ты будешь зарабатывать, что нужно делать, сложно ли это, сколько отнимает время. Пожалуй начнём с начала, первым делом тебе понадобится в этом боте получить свой личный код который будут вводить те кого ты пригласил, от того какой тариф ты выбрал бесплатный или платный зависит то сколько ты будешь зарабатывать в бесплатном ты будешь получать меньше чем в платном, далее тебе нужно с помощью соц. сетей или другим способом рассказать об этом способе заработка, после того как ты нашел тех кто заинтересовался твоим предложением ты должен всё подробно ему рассказать или отправить смотреть эту информацию сюда в этого бота, далее если "клиент" соглашается попробовать то необходимо скинуть ему свой "спец. код"- который можно посмотреть в разделе "мой спец код", после он выбирает тариф- который можно поменять в любой момент на платный, если он не был выбран сразу, если клиент оплатил платный тариф то  80%суммы уходит тому кто пригласил клиента. ❗️Просим запомнить❗️ что при оплате через сбербанк оплата проходит в период от 1 до 2 суток, а при оплате через qiwi она проходит моментально!'''
text_9 = '''вы в разделе отзывов'''
text_10 = '''посмотреть другие отзывы можно тут'''
text_11 = '''публиковать отзыв можно раз в 6 часов'''
text_12 = '''следующее введённое вами сообщение будет опубликовано в канале с отзывами'''
text_13 = '''ваш отзыв опубликован, спасибо за ваше мнение. Вы в разделе отзывов'''
text_14 = '''Этот баланс нельзя вывести, он нужен только для внутренних покупок. Ваш баланс следующий'''
text_15 = '''вы можете пополнить свой баланс через qiwi по ссылке https://qiwi.com/n/OTEAV080, введя в комментарий ваш одноразовый код '''
text_16 = '''выберете дальнейшие действия'''
text_17 = '''вашего перевода не обнаружено, попробуйте ещё раз, а если не помогло, то обратитесь в поддержку'''
text_18 = '''мы увидели новый перевод, и уже пополнели вам баланс, теперь на вашем кошельке '''
text_19 = '''вы в главном меню'''
text_20 = '''Это статистика за всё время, вы заработали от приглашений '''
text_21 = '''выберете, как вы бы хотели получать прибыль'''
text_22 = '''введите ваш номер телефона, к которому привязан qiwi кошелёк в формате 89008007060, если будет не верный, то мы просто не сможем вам отправлять процент'''
text_24 = '''вы ввели не правильно номер телефона, введите ещё раз, но в формате 89008007060 (11 цифр)'''
text_25 = '''внесённые данные сохранены, вы можете изменить их в разделе настроек'''
text_26 = '''у вас нет ни одного специального кода, вы можете создать его'''
text_27 = '''выберете, какой спец. код вы хотите создать:\n*мини (бесплатный и комиссия 60%)\n\n*полный (100 руб и комиссия 20%)'''
text_28 = '''у вас уже есть максимальный спец. код'''
text_29 = '''теперь вы можете приглашать своих друзей и других людей, говоря им свой новый спец. код '''
text_30 = '''у вас есть максимальный спец. код '''
text_31 = '''на вашем балансе должно быть как минимум 100 рублей, вы можете пополнить его в разделе "мой баланс" '''
text_32 = '''Поздравляем с покупкой, теперь вы можете приглашать своих друзей'''
text_33 = '''Вы ранее уже создали бесплатный, уменьшенный спец. код'''
text_34 = '''Но можно оформить улучшенный спец.код всего за 100 руб. (акция в первый месяц)'''
text_35 = '''У вас нет доступа к этой команде!'''
text_36 = '''введите ваш номер карты, на которую мы будем вам оправлять ваш доход, если будет не верный, то мы просто не сможем вам отправлять деньги'''
text_37 = '''Так как вы выбрали тип вывода средств через карту, то мы не можем автоматически присылать вам деньги, придётся ждать, когда вы заработаете более 100 рублей и мы оформим вашу прибыль, это не быстрый процесс'''
text_38 = '''Вы можете пополнить свой баланс через Сбербанк на карту 4279380677745335, введя в сообщение ваш одноразовый код '''
text_39 = '''И затем просто ждать, кода ваш перевод одобрят наши сотрудники, это может занять некоторое время, но перевод через qiwi происходит моментально'''
text_40 = '''Тут есть все наши каналы , чтобы выбраться отсюда напишите /start'''
text_41 = '''Ваше пополнение баланса обработали, вы можете проверить в разделе "мой баланс" '''
text_42 = '''Вы заработали достаточно, чтоб вывести средства, и наш сотрудник вывел вам на карту деньги, проверьте'''
text_43 = '''Здравствуйте, у вас не корректно внесены данные для перевода и наш сотрудник не может сделать перевод, обновите в настройках свои данные'''
text_44 = '''Здесь вы можете изменить некоторые свои данные о выводе и написать нам в поддержку'''
text_45 = '''Следующее введённое сообщение будет видно для администрации, которая вам может быть ответит, спамить пожалуйста не надо'''
text_46 = '''Ваше сообщение отправлено, ждите ответа'''
text_47 = '''тут есть все наши каналы и чаты которые могут вам пригодиться'''



button_back = 'вернуться назад'
button_1 = 'у меня нету'
button_2 = 'я ознакомился с правилами и принимаю их'


button_3 = 'напомнить правила'   # +
button_4 = 'мой баланс'          # +
button_5 = 'статистика'          # +
button_6 = 'публиковать отзыв'   # +
button_7 = 'спец. код'           # +
button_8 = 'инструкция'          # +
button_13 = 'настройки'          # +

button_9 = 'публиковать новый отзыв'

button_10 = 'проверить пополнение баланса'
button_11 = 'пополнить через qiwi'
button_12 = 'пополнить через Сбербанк'

button_14 = 'на счёт qiwi'
button_15 = 'на карту Сбербанк'

button_16 = 'создать'
button_17 = 'мини (бесплатный и комиссия 60%)'
button_18 = 'полный (100 руб и комиссия 20%)'

button_19 = 'создать запрос на вывод баланса'

button_20 = 'изменить способ вывода средств и номер'    # +
button_21 = 'написать в поддержку'                      # +
button_22 = 'все наши каналы и чаты'                    # +



buttons_main_menu = [[button_8, button_3], [button_4, button_7], [button_6, button_5, button_13]]
buttons_comment_menu_1 = [[button_9], [button_back]]
buttons_setings_menu = [[button_20, button_21, button_22], [button_back]]